Repository: NoopikxD/PromtTest
Catalog: CorpusSearch/CorpusSearch/en-ru.tmx
Source language: en
Languages: ru

source: Tails, we just have to go straight ahead, right?
ru: Тейлс, мы просто должны бежать прямо, так?

source: That' s what it says.
ru: Так говорит навигатор.

source: That has to be Black Eggman!
ru: Это и есть Тёмный Роботник!

source: That is correct.
ru: Правильно!

source: I am Black Eggman.
ru: Я - Тёмный Роботник.

source: I congratulate you on eluding my traps and making it all the way here.
ru: Поздравляю с тем, что избежали всех моих ловушек на пути сюда.

source: We don' t have time to play your little games!
ru: У нас нет времени играть в твои игры!

source: Get out of our way!
ru: Уйди с дороги!

source: I don' t think so!
ru: Это будет не так то просто!

source: You fool, this armor is made of a super polymer alloy!
ru: Глупец, ты не сможешь разрушить мою полимерную броню!

source: You...
ru: Ах ты...

source: Where are you little brats hiding?
ru: Вам не спрятаться от меня!

source: Come out here!
ru: Покажитесь!

source: We don' t have time to mess around with this guy!
ru: У нас нет времени разбираться с этим роботом!

source: Which way to Eggmanland?
ru: Как попасть отсюда в Роботрополис.

source: Let me check...
ru: Секундочку...

source: That way!
ru: Туда!

source: It' s past that highway!
ru: Сразу после этого шоссе!

source: Okay, Sonic!
ru: Сделаем это, Соник!

source: Black Eggman, you slowpoke!
ru: Роботник!

source: We know you can' t keep up right now, so we' il just have to finish this game later.
ru: Так что закончим эту игру позже, хорошо?

source: This is bad!
ru: Бежим!

source: I didn' t know that thing could fly!
ru: Я не знал, что эта штука еще умеет летать!

source: Tails, grab onto me!
ru: Тейлс, держись за меня!

source: We' re safe!
ru: Это было близко!

source: Don' t think you' re safe yet.
ru: Не думайте, что вы в безопасности!

source: Neither one of you can swim, so you' il both drown in the ocean below.
ru: Никто из вас не умеет плавать, так что вы оба утонете в океане!

source: I can' t swim!
ru: Я не умею плавать!!

source: Gurgle, gurgle, gurgle...
ru: Я тону!! * бульк, бульк *

source: I' ve finally gotten those two out of the way!
ru: Наконец я избавился от этих двоих!

source: That worked pretty well.
ru: Кажется сработало!

source: Yeah, let' s go.
ru: Пошли.

source: Why me?
ru: Ну почему я?

source: Boom!
ru: Я вас вижу!

source: You fools!
ru: Глупцы!

source: Did you really think I' d fall for a stupid trick like that?
ru: Вы что, думали я куплюсь на такой дешёвый трюк?

source: Take this!
ru: Получайте!

source: What is this stuff?
ru: Что это за штуки?

source: Now, it' s time for this!
ru: Скажи "сыр"

source: Now, I just have to finish you off.
ru: Теперь, осталось закончить с тобой.

source: There' s no way those missiles could' ve gotten rid of Sonic so easily.
ru: Ты не мог так просто избавиться от Соника с помощью этих ракет.

source: It' s coming back at you, Black Eggman!
ru: Не так быстро, Тёмный Роботник!

source: Oh no!
ru: О, нет!

source: Darn!
ru: Чёрт!

source: You might have the fastest feet in the world, but it you can' t run, you' re just a normal hedgehog.
ru: Может быть, ты и самый быстрый в мире, но если ты не можешь бежать, то ты всего лишь обычный ёжик!

source: You will never make it to Eggmanland!
ru: Вам никогда не удастся попасть в Роботрополис.

source: Try to run away from this!
ru: Тебе не спастись!

source: Sonic, I' il save you!
ru: Соник, я освобожу тебя!!

source: Knuckles!
ru: Наклс!

source: Hurry and save Sonic!
ru: Быстрее, спасай Соника!

source: If my tails are stuck together, I can' t fly!
ru: Мои хвосты склеились, я не могу взлететь!

source: I' ve got it!
ru: Точно!

source: Sonic, grab onto this!
ru: Соник, я иду!

source: Sonic, you can do it!
ru: Соник, давай, я знаю - ты можешь!

source: However...
ru: Кончились патроны, тебе повезло!

source: Not lucky enough!
ru: Но не полностью!

source: I owe you one, Knuckles.
ru: Спасибо, Наклс!

source: Right back at you.
ru: Думаю, мы в расчёте.

source: It doesn' t matter.
ru: Да неважно...

source: You' re running away?
ru: Уже убегаешь?

source: I' m not going to let you go, Black Eggman!
ru: Я не дам тебе уйти, Тёмный Роботник!

source: Don' t worry, we' il meet again soon!
ru: Не беспокойся, мы еще скоро встретимся!

source: Grab onto me, Sonic!
ru: Соник, держись за меня.

source: Sonic' s ruined things again!
ru: Вечно Соник разрушает мои творения!

source: He' d better enjoy this feeling now, because once he gets to Eggmanland, he' il have to fight something even worse than Black Eggman!
ru: Лучше ему пока, наслаждаться этой победой, потому что в Роботрополисе ему придётся сразиться с противником похуже Тёмного Роботника!

source: What do you mean, worse than Black Eggman?
ru: Что ты имеешь ввиду: "похуже Тёмного Роботника"?

source: You' re talking about yourself!
ru: Ты что говоришь о себе самом?

source: You' d better keep your hands off my Sonic, or I' il never forgive you!
ru: Лучше держись подальше от моего Соника, иначе я никогда не прощу тебя!

source: Thanks for saving us there, Knuckles.
ru: Спасибо, что спас нас, Наклс.

source: Yeah, that' s one more job that I' m not going to get paid for.
ru: Да уж, еще одна работа, за которую я не получу не гроша.

source: Oh well, we' ve been friends for long enough.
ru: Впрочем, мы же были друзьями долгое время.

source: I guess I can just put this on your tab.
ru: Думаю, запишу это на ваш счёт.

source: So will you return to treasure hunting?
ru: Собираешься продолжить охоту за сокровищами?

source: After all, that' s what I live for!
ru: Поиск сокровищ - моё любимое занятие!

source: The sun' s already setting!
ru: Солнце садится!

source: We' ve got to hurry!
ru: Мы должны поспешить!

source: What is that thing?
ru: Что это, смотрите!

source: That' s Eggmanland!
ru: Это должен быть Роботрополис!

source: Incredible!
ru: Невероятно!

source: I hope we see you again, Knuckles!
ru: Надеюсь, скоро увидимся, Наклс.

source: See you.
ru: Пока.

source: See you later!
ru: Давай, Наклс, увидимся.

source: Hey, I' d worry about you two if I sent you in alone!
ru: Эй, я не пущу вас туда вдвоём одних.

source: See you!
ru: Вперёд!

source: What are you waiting for?
ru: Давайте, чего вы ждёте?

source: If you don' t hurry, that thing' s going to explode!
ru: Если не поторопимся, то этот генератор взорвётся!

source: Wait up, Knuckles!
ru: Подожди, Наклс!

source: So this must be the entrance to Eggmanland.
ru: Видимо, это вход в Роботрополис.

source: I never expected Eggman to live in such an awesome place!
ru: Никогда не думал, что Роботник живёт в таком удивительном месте!

source: This is no time to be blown away.
ru: Вы что, хотите взорваться вместе с этим местом?

source: Keep going straight ahead!
ru: Мы на верном пути, не останавливайтесь!

source: I' m really starting to get excited about this, Sonic.
ru: Мне уже начинает это нравиться, Соник.

source: Just don' t let your guard down or you' il seriously regret it, Knuckles.
ru: Главное, будь начеку, иначе ты пожалеешь, Наклс.

source: Sonic, leave these guys to me and go on ahead!
ru: Оставьте их мне, не теряйте времени!

source: Tails, fly!
ru: Хорошо, удачи!

source: You have to fly!
ru: Взлетай!

source: Yeah, right!
ru: А, точно!

source: It' s too heavy for me to move!
ru: Он слишком тяжёлый!

source: I' il have you out of there in no time!
ru: Не беспокойся, я вытащу тебя оттуда!

source: Sonic, are you all right?
ru: Соник, ты цел?

source: Something' s moving!
ru: Там что- то шевелится!

source: It' s a robot that looks exactly like Sonic!
ru: Этот робот выглядит в точности как Соник!

source: What does all this mean?
ru: Что всё это значит?

source: It' s pretty!
ru: Красиво!

source: Black Eggman' s ghost!
ru: Это Призрак Тёмного Роботника!

source: It' s broken.
ru: Просто разломалось на кусочки.

source: Watch where you' re putting your hands!
ru: Эй, следи за своими лапами!

source: I' m sorry, I didn' t mean to!
ru: Я не хотел!!

source: Please stop, Sarah!
ru: Пожалуйста, хватит, Сара!

source: Why are Sarah and Eggman here together?
ru: Что Роботник и Сара делают там вместе?

source: I get it, you' re Black Eggman!
ru: Я не виноватааа!

source: Look at that, now you' ve made her cry.
ru: Посмотри- ка, ты заставил её заплакать.

source: Black Eggman and the haywire Robot Generator were all part of his scheme.
ru: Тёмный Роботник, этот генератор - всё это было частью его плана.

source: He planned the whole thing to trap you!
ru: Он всё это спланировал, только чтобы поймать тебя!

source: What does all this mean, Eggman?
ru: Что вся эта фигня значит, Роботник?

source: I don' t believe you fell for my trap and made it all the way here.
ru: Проделали весь этот путь, и теперь тут же умрёте!

source: Good job, Sonic!
ru: Хорошая работа, Соник!

source: You' re kidding me!
ru: Это ужасно!

source: This is the greatest invention of Eggman, scientist extraordinaire!
ru: Я, величайший изобретатель, Доктор Роботник, наконец, закончил своё величайшее творение!

source: I call it the Hyper Metal Sonic.
ru: Я назвал его Гипер Металсоник.

source: Pretty good, don' t you think?
ru: Неплохо, не правда ли?

source: You might have made a robot that looks like him, but he' s no match for the real Sonic!
ru: Может быть этот робот и выглядит как Соник, но ему не сравниться с Настоящим Соником!

source: Tails, it should be apparent to you.
ru: Тейлс, тебе то это должно быть в первую очередь понятно!

source: Sonic wasn' t being electrocuted earlier.
ru: То, чему подвергся Соник не было электрошоком.

source: Instead, I was transferring all his data to the robot.
ru: Тем самым, я скопировал всю его жизненную информацию!

source: He is the fastest, most powerful battle machine every to walk Planet Freedom!
ru: Это наибыстрейшая, наимощнейшая машина на всей Планете Свободы!

source: What are you planning on doing with that thing?
ru: Что ты собираешься делать с этим идиотским роботом- соником?

source: Isn' t it obvious?
ru: Разве не очевидно?

source: I' m going to use Metal to destroy the real Sonic, and then I' m going to destroy the Land of the Sky.
ru: Я собираюсь использовать его, чтобы уничтожить настоящего Соника, а затем, я полностью уничтожу Небесные Земли.

source: There' s no way you' il get away with this!
ru: Тебе всё так просто не удастся!

source: Let Sarah go, Eggman!
ru: Сейчас же отпусти Сару, Роботник!

source: Tell me that after you' ve defeated him.
ru: Обговорим это, когда победишь его!

source: Go get him, Hyper Metal Sonic!
ru: Взять его, Гипер Металсоник!

source: Tails, Knuckles, don' t try to help me.
ru: Все назад, никто не смейте помогать мне!

source: I want to take him out on my own!
ru: Я уничтожу его сам!

source: Man, he' s fast!
ru: Чёрт, он быстр!

source: This is the first time I' ve ever seen Sonic like this!
ru: Никогда не видел никого, кто мог бы тягаться с Соником!

source: That is an invention worthy of being called my greatest creation ever!
ru: Наконец то я изобрёл что- то, что может назваться моим величайшим творением!

source: Keep going, Metal Sonic!
ru: Соник в беде!

source: Wait, Tails!
ru: Стой, Тейлс, вернись!

source: Hold up, Tails!
ru: Стой!

source: But if we don' t hurry then Sonic...
ru: Но если мы не поторопимся, то Соник...

source: Calm down, Tails!
ru: Успокойся, Тейлс!

source: There' s no way that either one of us can catch up with them.
ru: Ни тебе, ни мне не удастся догнать их.

source: We' ve got to think of another way!
ru: Нам нужно придумать что- то еще.

source: He did say something about destroying the Land of the Sky, didn' t he?
ru: Он ведь сказал, что собирается уничтожить Небесные Земли, не так ли?

source: I' m sorry, was that uncomfortable, Sarah?
ru: Извини, я знаю, что это было неудобно, Сара!

source: Come on, don' t be mad.
ru: Перестань, не дуйся.

source: Just stay with me a little bit longer.
ru: Просто, побудь со мной еще немного.

source: No, I want to go home now!
ru: Сейчас же!

source: I' il show you something really spectacular.
ru: Если ты подождёшь еще несколько минут, я покажу тебе нечто захватывающее!

source: Where did he go?
ru: Куда он делся?

source: That' s it!
ru: Кажется всё!

source: Perfect!
ru: Потрясающе!

source: Sonic has finally been defeated!
ru: Тейлс!

source: Hey, Tails, what' s wrong with you?
ru: Тейлс, что ты делаешь?

source: That' s a warp zone right in front of us!
ru: Точка телепортации прямо перед нами!

source: We' re catching the tornado, and we' re going home!
ru: Мы возьмём Торнадо и полетим домой!

source: Hey, hey, what about Sonic?
ru: Эй, а как же Соник?

source: What a nice, peaceful night.
ru: Какая прекрасная, спокойная ночь для отдыха на пляже.

source: Sonic, you' re back already?
ru: О, мистер Соник, не ожидал, что вы вернётесь так скоро?

source: Sonic, what' s the matter?
ru: Соник, что случилось?

source: Please stop it!
ru: Где, чёрт побери, я нахожусь?

source: Tails...
ru: Тейлс...

source: I remember leaving Eggmanland.
ru: Я помню, я покинул Роботрополис.

source: Is this all part of Black Eggman' s plan, too?
ru: Я должен остановить Металсоника!

source: Oh man!
ru: О нет!

source: The only one that would do something like this is Eggman!
ru: Единственный, кто мог всё это сделать - это Роботник!

source: It' s a lucky thing no one was staying here.
ru: Слава богу, что тут никого не было...

source: That old man was watching the house for us!
ru: Старик оставался тут и присматривал за домом!!

source: It doesn' t look like anyone touched the inside of this place.
ru: Кажется, никто тут вообще ничего не тронул!

source: Old man, where are you?
ru: Старичок, ты где- то здесь?

source: Tails, is that you?
ru: Я сзади, Тейлс?

source: Are you back already?
ru: Вы быстро вернулись!

source: Those are Sonic' s favorite clothes!
ru: Это любимая одежда Соника!

source: Don' t blame me if he gets mad at you!
ru: Не говори мне потом, что я тебя не предупреждал!

source: Don' t worry about it.
ru: Не беспокойся.

source: Sonic came back last night.
ru: Он был здесь этой ночью.

source: He forced me to put on these clothes and then he just flew away.
ru: Заставил меня надеть эту одежду, а потом просто улетел, не сказав не слова.

source: He flew away?
ru: Улетел?

source: It' s Metal!
ru: Метал!

source: Metal is really wreaking havoc here.
ru: Метал устроил здесь настоящий хаос.

source: At the rate he' s going, the Land of the Sky won' t last more than a few hours.
ru: С такой скоростью, от Небесных Земель ничего не останется в течении нескольких часов!

source: Now I can take my plan to the next stage.
ru: Пора переходить к следующей части моего плана.

source: Here you go, Sarah.
ru: Вот, Сара.

source: This is a present for you.
ru: Подарок, который я тебе приготовил.

source: Yahoo!
ru: Ух ты!

source: You rock!
ru: Мне нравится!!

source: Tails, stop tinkering with that thing!
ru: Тейлс, хватит дурачиться с этой штукой

source: Let' s hurry up and find Sonic!
ru: У нас есть вещи поважнее - например, найти Соника!

source: This machine that Eggman gave me and Metal Sonic are built out of the same kinds of parts.
ru: Этот навигатор и Металсоник сделаны из деталей одного типа.

source: I think I can use that.
ru: Я думаю, это устройство можно переделать, чтобы оно работало по- другому.

source: You might be able to find Metal Sonic?
ru: Оно будет показывать нам где найти Металсоника!

source: But what if Metal Sonic and Sonic aren' t in the same place any more?
ru: Но что, если Металсоник и Соник будут не рядом?

source: Don' t worry.
ru: Не беспокойся.

source: Sonic and Metal will definitely be together.
ru: Соник и Метал точно будут в одном и том же месте.

source: Well, all of Sonic' s data was input into Metal' s memory.
ru: Потому, что в Метале находятся все данные Соника

source: His personality, his likes, his dislikes, even all his thoughts.
ru: Его личность, то, что ему нравится и не нравится, даже ход его мыслей!

source: That' s why he knew to come here.
ru: Вот почему он знал об этом месте.

source: He even gave the old man his favorite clothes.
ru: Он даже дал старичку его любимую одежду.

source: I understand that, but Metal' s still a robot.
ru: Я понимаю, но всё же - он робот!

source: Metal is operating on Sonic' s thoughts and motivations.
ru: Несмотря на то, что он робот, он действует и думает так же, как и Соник.

source: He knows everything that Sonic' s ever seen or felt.
ru: Он знает всё, что Соник когда либо видел или чувствовал.

source: The same goes for Sonic.
ru: Так же, как и Соник.

source: In other words, it' s just like they' re twins.
ru: Другими словами, они как близнецы.

source: They' re twins, huh?
ru: Хм...

source: Green Lake City has been flooded!
ru: Город Гринлейк затоплен!

source: Forest Town is currently on fire!
ru: Город Форест в огне!

source: We' ve discovered the source of the disturbances.
ru: Мы обнаружили причину этих беспорядков!

source: We' il patch it through to the monitors.
ru: Вот, посмотрите!

source: Lmpossible!
ru: Невероятно!

source: Get Sonic' s house on the line immediately.
ru: Немедленно свяжитесь с домом Соника!

source: Yes, Sir.
ru: Слушаюсь, Сэр!

source: Shut up already, I' m busy!
ru: Заткнитесь, я занят!

source: Isn' t somebody going to pick that up?
ru: Эй, кто- нибудь поднимет трубку?

source: Hey, Tails!
ru: Тейлс, ответь!

source: Isn' t anyone there?
ru: Кто- нибудь там?

source: Oh no, not that idiot!
ru: О нет, только не этот идиот!

source: What' s he doing now?
ru: Что он делает там?

source: Hey, it' s me!
ru: Эй, это говорит Президент!

source: Listen to me right now!
ru: Выслушай меня сейчас же!

source: Shut up!
ru: Чего разорались!?

source: I' m Knuckles, Sonic' s best friend.
ru: Я Наклс, лучший друг Соника.

source: Is Sonic there?
ru: Соник тут?

source: Is Sarah safe?
ru: Сара в безопасности?

source: What happened to Black Eggman?
ru: И что случилось с Тёмным Роботником?

source: Did you stop the generator?
ru: Вы выключили тот генератор?

source: You sure are an annoying old man.
ru: Послушай, ты меня отвлекаешь.

source: I' m busy here!
ru: Я занят!

source: Mr. President!
ru: Как дела, мистер Президент?

source: Look, Eggman, don' t I look cute?
ru: Роботник, правда, я замечательно выгляжу?

source: Yes, it suits you very well, Sarah.
ru: Да, тебе очень идёт, Сара.

source: But why did you give me a wedding dress?
ru: Но почему ты подарил мне свадебное платье?

source: Once Metal has destroyed the Land of the Sky, it' il just be the two of us.
ru: Как только Метал уничтожит Небесные Земли, останемся только мы вдвоём.

source: Then we can get married and live the rest of our lives together, Sarah!
ru: А потом мы поженимся, и будем жить вместе долго и счастливо, Сара!

source: Go to sleep, go to sleep, close your eyes...
ru: Ты что спятил?

source: Who told you I wanted to marry you anyway?
ru: С чего ты взял, что я вообще хочу выйти за тебя?

source: I won' t do it!
ru: Этого не будет!

source: So that' s what really happened.
ru: Так вот, что произошло.

source: But I still don' t think it will enough to destroy the Land of the Sky.
ru: Но всё равно, я не думаю, что это существо способно разгромить Небесные Земли.

source: I' ve traveled all over the subterranean levels of this planet, and I' ve seen it.
ru: Я излазил всю подземную часть планеты и я знаю, как это можно сделать.

source: At the northernmost tip of this continent, all the continents in the Land of the Sky are linked by a huge glacier.
ru: Она поддерживает Небесные Земли.

source: Many rivers of magma run beneath the surface of the continents.
ru: Под поверхностью планеты протекают многочисленные реки магмы.

source: They' re shaped like blood vessels under the glacier.
ru: Ледник работает как вены, магма течёт по ним как кровь.

source: If the tip of this glacier were ever punctured by an explosion, the magma would pour directly into the glacier, melting all the ice.
ru: Если вершина ледника будет разрушена взрывной волной, то вся магма выльется, плавя весь лёд на своём пути.

source: Due to the centrifugal force of the planet, they' il be thrown into outer space.
ru: Разумеется, как только все небесные континенты лишатся своей опоры, они больше не будут связаны с планетой и разлетятся в открытый космос.

source: This is impossible!
ru: Это невозможно!

source: Mr. President, please don' t tell Sonic a word about any of this!
ru: Мистер Президент, пожалуйста, не говорите Сонику об этом ни слова об этом!

source: I know that!
ru: Конечно, я понимаю!

source: Why am I not supposed to be told about this, Tails?
ru: Почему это я не должен этого знать?

source: Sonic, you' re safe!
ru: Соник, слава богу, что ты жив!

source: I heard all of it.
ru: Поздно, я всё слышал.

source: Sonic, you don' t understand!
ru: Нет, Соник, ты не понимаешь!

source: Let me explain!
ru: Это очень плохо!

source: Metal Sonic has turned northward and is moving at top speed.
ru: Металсоник развернулся и направился в сторону севера планеты с огромной скоростью.

source: What did you say?
ru: Что??

source: Metal is planning to melt the glaciers to the north!
ru: Метал собирается расплавить ледник!

source: Roger!
ru: Мы должны остановить его любой ценой!

source: Tails, Sonic just disappeared.
ru: Тейлс, Соник только что исчез.

source: He must have gone after Metal.
ru: Должно быть, он направился искать Метала.

source: He went north!
ru: На северный полюс!

source: We' il have to do our best too.
ru: Мы тоже должны помочь ему.

source: We have to stop Metal no matter what!
ru: Мы должны остановить Метала любой ценой!

source: He' s headed to the North Pole.
ru: Ха ха, он направился к северному полюсу.

source: That means Metal has finally found the point of destruction.
ru: Значит, он нашёл слабое место этой планеты.

source: Here we go, Sarah!
ru: Готовься, Сара!

source: I don' t want to get married at the North Pole!
ru: Я не хочу выходить замуж посреди северного полюса!

source: I told you to stop!
ru: - Успокойся... пристегнись получше, сейчас мы телепортируемся прямо туда.

source: Now we have to access Metal' s memory banks and adjust them.
ru: Отлично!

source: Then maybe we can awaken Sonic' s personality in him!
ru: Теперь у нас есть доступ к памяти Метала, мы можем настроить её, чтобы он стал хорошим, как Соник.

source: Tails, are you sure we can trust that thing?
ru: Тейлс, ты уверен, что мы можем доверять этой штуке?

source: After all, it used to be Eggman' s.
ru: В конце концов, она же сделана Роботником.

source: Just keep your eyes open for Sonic.
ru: Просто смотри внимательно, ищи Соника.

source: I know what to do!
ru: Я знаю, что мне делать.

source: Oh no, I' m too late.
ru: А нет, я опоздал.

source: He' s got to be around here somewhere!
ru: Метал должен быть всё еще где- то здесь!

source: Then this will be the real fight.
ru: Что ж, устроим настоящую битву.

source: We' il fight until only one of us is left standing, all right, Metal?
ru: Будем драться, пока не останется один Соник.

source: This world isn' t big enough for the both of us, you say?
ru: Хочешь сказать, что этот мир недостаточно большой для нас двоих?

source: Well, the feeling' s mutual.
ru: Что ж, я согласен!

source: You might know everything I' m going to do, but I know everything you' re going to do too!
ru: Может ты и знаешь заранее мой следующий шаг, но это тебе не поможет, потому что я знаю, что сделаешь ты!

source: It' s a strange feeling!
ru: Странно, не правда ли?

source: Sonic, you' re still alive?
ru: Ты всё еще жив?

source: Sonic, what' s wrong with you?
ru: Соник, что ты делаешь?

source: You pervert!
ru: Нет, нет, извращенец!

source: Get away, you little piece of tin!
ru: Отстань от меня, маленький оловянный кусок!

source: I get it, you synchronized yourself with Metal.
ru: Я понял, ты синхронизировал себя с Металсоником!

source: This is my chance!
ru: Сейчас я тебя!..
